#define _CRT_SECURE_NO_WARNINGS  //取消scanf不安全报警
#include <stdio.h>
//在屏幕上输出9*9乘法口诀表

int main()
{
	int i = 0;  //打印行
	for (i = 1; i <= 9; ++i)   //外层循环变量控制行
	{
		int j = 0; //打印列
		for (j = 1; j <= i; ++j)//内部循环变量控制列
		{
			printf("%d*%d=%-2d  ", j, i, i*j);  //-2d：左对齐； 2d：右对齐
		}
		printf("\n");
	}
	return 0;
}
/*
1*1=1
2*1=2 2*2=4
3*1=3 3*2=6 3*3=9
*/


//独立输出一个 N×N 的乘法表:  每两个乘法等式之间用一个制表符\t分隔，最后一个等式后面不需要输出制表符\t。
//思路：使用两个循环，外循环控制输出的行数，内循环控制输出的内容及每行输出的数的个数，利用if语句有条件的输出空格（制表符）
//int main()
//{
//    int N;//键盘输入的数
//    int k = 1;//用于判断空格输出
//
//    scanf("%d", &N);
//
//    if (k <= N)
//    {
//        for (int i = 1; i <= N; i++)//外循环用于控制输出的行数
//        {
//
//            for (int j = k; j <= N; j++)//内循环用于控制每行输出的内容，以及每行输出的数字个数
//            {
//
//                printf("%d*%d=%d", i, j, i * j);
//                if (j != N)//用于判断是否输出空格   注：每行最后一个数后不输出空格
//                {
//                    printf("\t");
//
//                }
//                else
//                {
//                    printf("\n");
//                }
//            }
//            k++;
//        }
//
//    }
//
//    return 0;
//}
